
bank_1 = '最大两个字看不懂是吧？幼儿园没读完？'
bank_2 = '请先将欠款还清进再借款。'
bank_3 = "开户成功"
bank_4 = '积分已到账，请尽快偿还，利息为每小时百分之一，时间不足一小时按一小时计。'
bank_5 = '你口袋里就这点钱，你还尼玛呢！？'
bank_6 = '你还nm呢！利息都还不全？爬！'
def bank_7(money, num):
    return f'还积分成功，目前待还积分{money-num}'
bank_8 = '恭喜你还清积分'
bank_9 = '先把欠的钱还了再想着转账吧！'
bank_10 = '请输入@要交易的人+积分\n'
bank_11 = '转你妈呢转！'
bank_12 = '转账有这么转的？'
def bank_13(jjj):
    return f'交易成功,{jjj}积分已到账'
def bank_14(i):
    return f'{i}积分已到账。'
def bank_15(i):
    return f'{i}积分已扣除。'
bank_16 = '请输入“想要借的积分数目”，最大可以借100。\n'
bank_17 = '请输入“打算还的积分数目”'
def bank_18(loan, pays):
    return f'当前欠款积分：{loan}\n利息：{pays}，总计待还：{loan + pays}'
bank_19 = '您还没有开户，请先开户呢！使用“#开户”'
bank_20 = '积分不够，开户失败。'
bank_21 = '爬！'

pa = '爬'

dice_1 = '比赛已经开始了，输入‘#骰子’即可参与。'
dice_2 = '比赛开启成功，输入‘#骰子’即可参与。'

