# coding:utf-8
achieve_list = {
    '全卡牌终极玩家': ['林佳奇——通天龙王', '视角姬——银河系二王子', '陈扬——B站螃蟹', '林佳奇——吃素的狮子', '视角姬——无业游民', '陈扬——六道轮回', '林佳奇——百万调音师', '团子', '小仙若', '小初', '李彧', '桃核', '欠欠', '欣小萌', '泡芙喵', '漠漠——多情浪子', '漠漠——工具女', '碳酸熊卡', '蚀血之暗', '豆豆子', '醋醋', '陶宇杰', '韩小沐', 'Dio', '丧男', '伢伢', '妥妥', '小陈', '戢子丰', '李正雄', '曲一畅', '李荣民', '林汉业', '果哝双子', '王志达', '秋雾雾', '老菌菌', '萌爱moi', '萍萍', '西凉', '韩忠颖', '460缝合怪', 'coser丁', 'COSER丙', 'Coser乙', 'Coser甲', 'Dio的家', '东尼羞耻板', '乌龙', '二饼', '亮亮', '伪醋醋', '元宝', '动漫高手', '喜鹊', '实体娃娃A', '实体娃娃B', '小暗做的屎', '小暗的兔耳', '小暗的黑丝', '小狮子玩偶', '帝王蟹A', '帝王蟹B', '帝王蟹C', '帝王蟹D', '杨秘书', '油炸冰棍', '消防员', '火鸡', '狮子同学乙', '狮子同学甲', '狮子日记1', '狮子日记2', '狮子游泳圈', '狮子班主任', '狮子班长', '范助理', '被烤的火鸡', '视角姬的自恋照', '视角姬的黑丝', '视角姬车模乙', '豆豆子的胸垫', '车模丁', '车模丙', '车模甲', '鬼畜高手', '刘苏良', '朱一旦', '王瀚哲', '老番茄', '陈再强', 'A路人', '逗川', '小V', '欠欠——独立女仆长', '小潮院长', '海皇', '平守', '伊丽莎白鼠', '痒局长', '北极土豆'],
    '终极460': ['林佳奇——通天龙王', '视角姬——银河系二王子', '陈扬——B站螃蟹', '林佳奇——吃素的狮子', '视角姬——无业游民', '陈扬——六道轮回'],
    '高级460': ['林佳奇——通天龙王', '视角姬——银河系二王子', '陈扬——B站螃蟹'],
    '中级460': ['林佳奇——吃素的狮子', '视角姬——无业游民', '陈扬——六道轮回'],
    '狮子CP团': ['林佳奇——吃素的狮子', '小仙若', '小初', '豆豆子', '醋醋', '欣小萌', ],
    '防道少女团': ['陈扬——六道轮回', '漠漠——工具女', '醋醋', '韩小沐', '伢伢', '妥妥',  '果哝双子',  '萍萍', ],
    '视角姬女仆团': ['视角姬——无业游民', '欠欠', '团子', '碳酸熊卡', '萌爱moi', ],
    # '女仆长': ['欠欠——独立女仆长'],
    '四大欠王': ['林佳奇——吃素的狮子', 'A路人', '伊丽莎白鼠', '痒局长'],
    '狮林国际': ['林佳奇——吃素的狮子', '陶宇杰', '曲一畅', '李荣民', '王志达', '秋雾雾', '老菌菌', '西凉', '韩忠颖', '李彧', ],
    '半壁江山': ['漠漠——工具女', '醋醋', '韩小沐', '伢伢', '妥妥',  '果哝双子',  '萍萍',  '小仙若', '小初', '豆豆子', '醋醋', '欣小萌', ],
    '小潮工作室': ['小潮院长', '海皇'],
    '0+7狂热者': ['林佳奇——吃素的狮子', '逗川', '狮子同学乙', '狮子同学甲', '狮子日记1', '狮子日记2', '狮子游泳圈', '狮子班主任', '狮子班长', ],
    'coser爱好者': ['coser丁', 'COSER丙', 'Coser乙', 'Coser甲'],
    '车模爱好者': ['视角姬车模乙', '车模丁', '车模丙', '车模甲'],
    '帝王蟹爱好者': ['帝王蟹A', '帝王蟹B', '帝王蟹C', '帝王蟹D'],
    '萌宠爱好者': ['乌龙', '二饼', '元宝', '喜鹊', ],
    '猎奇控': ['小暗做的屎', '小暗的兔耳', '小暗的黑丝', '视角姬的自恋照', '视角姬的黑丝', '460缝合怪', '豆豆子的胸垫', ],
    '物品收集者': ['Dio的家', '东尼羞耻板', '伪醋醋', '动漫高手', '鬼畜高手', ],
}


